In [2]:
# Import libraries
import pandas as pd
import numpy as np
import geopandas as gpd
import libpysal as lps
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
# Load amenity data (0.1 x 0.1 mile grid)
df_amenity1 = pd.read_csv('data/df_amenity_2021_lab_01bbox.csv')
df_amenity2 = pd.read_csv('data/df_amenity_2021_lab_01bbox_2.csv')

In [5]:
print(df_amenity1.shape)
print(df_amenity2.shape)

(93274, 2)
(93274, 7)

In [7]:
df_amenity2.head()

   Unnamed: 0  cafe  fast_food  restaurant  college  school  university
0           0     0          0           0      0.0       0           0
1           1     0          0           0      0.0       0           0
2           2     0          0           0      0.0       0           0
3           3     0          0           0      0.0       0           0
4           4     0          0           0      0.0       0           0

In [14]:
df_amenity1.drop(['Unnamed: 0'], axis=1)

       bar
0        0
1        0
2        0
3        0
4        0
...    ...
93269    0
93270    0
93271    0
93272    0
93273    0

[93274 rows x 1 columns]

In [15]:
# Combine the two dataframes
df_amenity = pd.concat([df_amenity1.drop(['Unnamed: 0'], axis=1), df_amenity2.drop(['Unnamed: 0'], axis=1)],
                         axis=1)

In [16]:
df_amenity.shape

(93274, 7)

In [17]:
df_amenity.head()

   bar  cafe  fast_food  restaurant  college  school  university
0    0     0          0           0      0.0       0           0
1    0     0          0           0      0.0       0           0
2    0     0          0           0      0.0       0           0
3    0     0          0           0      0.0       0           0
4    0     0          0           0      0.0       0           0

In [18]:
temp = gpd.read_file('data/eviction_count_bg_2021.geojson', driver="GeoJSON")
temp.head()

,STATEFP,COUNTYFP,TRACTCE,BLKGRPCE,GEOID,NAMELSAD,MTFCC,FUNCSTAT,ALAND,AWATER,...,judgment_year,judgment_month,judgment_day,amount,amount_filed,X,Y,lon_short,lat_short,geometry
0,48,113,013901,2,481130139012,Block Group 2,G5030,S,1241037,0,...,200.0,NaN,NaN,0.0,Not Non-Payment of Rent,-96.893021,32.925818,-96.895,32.925,"POLYGON ((-96.90265 32.93862, -96.90255 32.938..."
1,48,113,013901,2,481130139012,Block Group 2,G5030,S,1241037,0,...,200.0,NaN,NaN,NaN,NaN,-96.891444,32.926090,-96.890,32.925,"POLYGON ((-96.90265 32.93862, -96.90255 32.938..."
2,48,113,013901,2,481130139012,Block Group 2,G5030,S,1241037,0,...,200.0,NaN,NaN,NaN,NaN,-96.891444,32.926090,-96.890,32.925,"POLYGON ((-96.90265 32.93862, -96.90255 32.938..."
3,48,113,013901,2,481130139012,Block Group 2,G5030,S,1241037,0,...,200.0,NaN,NaN,NaN,NaN,-96.891444,32.926090,-96.890,32.925,"POLYGON ((-96.90265 32.93862, -96.90255 32.938..."
4,48,113,013901,2,481130139012,Block Group 2,G5030,S,1241037,0,...,200.0,NaN,NaN,0.0,Not Non-Payment of Rent,-96.891444,32.926090,-96.890,32.925,"POLYGON ((-96.90265 32.93862, -96.90255 32.938..."